{
  "holidays": {
    "January 13": {
      "name": "Lohri",
      "description": "Lohri is a popular winter Punjabi folk festival, celebrated primarily in the Indian subcontinent.",
      "history": "Lohri is traditionally associated with the harvest of the rabi crops and is celebrated to mark the end of winter.",
      "type": ["Cultural"],
      "howToCelebrate": "People gather around a bonfire, throw in sesame seeds, jaggery, and popcorn, and sing and dance to folk songs.",
      "relatedHolidays": ["Makar Sankranti", "Pongal"]
    },
    "January 14": {
      "name": "Makar Sankranti",
      "description": "Makar Sankranti is a Hindu festival dedicated to the sun god Surya. It marks the sun's transition into Capricorn (Makar) and the end of the winter solstice.",
      "history": "The festival has ancient origins and is mentioned in various Hindu scriptures. It signifies the start of longer days.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "People take holy dips in rivers, fly kites, prepare sweets made of sesame seeds and jaggery, and donate to the needy.",
      "relatedHolidays": ["Lohri", "Pongal", "Uttarayan"]
    },
    "January 26": {
      "name": "Republic Day",
      "description": "Republic Day is a national holiday in India that commemorates the adoption of the Constitution of India on 26 January 1950.",
      "history": "The Constitution of India was adopted on this day in 1950, making India a republic. It is one of three national holidays in India.",
      "type": ["National"],
      "howToCelebrate": "A grand parade is held in New Delhi, with various state and cultural performances, followed by the president's address to the nation.",
      "relatedHolidays": ["Independence Day", "Gandhi Jayanti"]
    },
    "February 14": {
      "name": "Basant Panchami",
      "description": "Basant Panchami is a Hindu festival celebrating Saraswati, the goddess of knowledge, music, and arts.",
      "history": "The festival marks the onset of spring and is celebrated across India, especially in educational institutions.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "People wear yellow clothes, offer prayers to Saraswati, and participate in kite flying.",
      "relatedHolidays": ["Vasant Utsav"]
    },
    "February 24": {
      "name": "Ravidas Jayanti",
      "description": "Ravidas Jayanti celebrates the birth of the Indian saint and poet Ravidas, who is revered as a spiritual leader in North India.",
      "history": "Ravidas Jayanti is celebrated on the full moon day in the month of Magh, and it marks the birth anniversary of Sant Ravidas.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "Devotees gather at Ravidas temples, offer prayers, and read his hymns and teachings.",
      "relatedHolidays": []
    },
    "March 8": {
      "name": "Maha Shivratri",
      "description": "Maha Shivratri is a Hindu festival dedicated to Lord Shiva. It is a major festival marked by fasting and night-long vigils.",
      "history": "Maha Shivratri is celebrated annually to honor Lord Shiva. It is believed that on this day, Shiva performed the Tandava, the cosmic dance of destruction.",
      "type": ["Religious"],
      "howToCelebrate": "Devotees observe fasting, perform night-long vigils, and offer milk and bel leaves to Shiva's idols.",
      "relatedHolidays": []
    },
    "March 24": {
      "name": "Holi",
      "description": "Holi, also known as the Festival of Colors, is a Hindu spring festival celebrated across India and Nepal.",
      "history": "Holi has ancient origins and celebrates the victory of good over evil, particularly the burning of Holika, the demoness.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "People throw colored powders at each other, dance, sing, and celebrate with festive foods and drinks.",
      "relatedHolidays": ["Dhulendi"]
    },
    "March 25": {
      "name": "Dhulendi",
      "description": "Dhulendi, also known as Holi, is celebrated the day after Holika Dahan. It's the day when people play with colors.",
      "history": "Dhulendi follows the day of Holika Dahan and is the main day of Holi when people splash colors on each other.",
      "type": ["Cultural"],
      "howToCelebrate": "People gather in open spaces, splash colors, and celebrate with music, dance, and sweets.",
      "relatedHolidays": ["Holi"]
    },
    "April 11": {
      "name": "Id-ul-Fitr",
      "description": "Id-ul-Fitr, also known as Eid, is an Islamic festival that marks the end of Ramadan, the holy month of fasting.",
      "history": "Eid has been celebrated by Muslims worldwide since the time of the Prophet Muhammad. It is a day of thanksgiving and charity.",
      "type": ["Religious"],
      "howToCelebrate": "Muslims attend special prayers, give Zakat (charity), and share festive meals with family and friends.",
      "relatedHolidays": ["Id-ul-Zuha", "Ramadan"]
    },
    "April 13": {
      "name": "Baisakhi",
      "description": "Baisakhi is a festival celebrated mainly in Punjab and Haryana, marking the start of the harvest season.",
      "history": "Baisakhi also commemorates the formation of the Khalsa in 1699 by Guru Gobind Singh. It is a major Sikh festival.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "People visit gurdwaras, perform traditional dances like bhangra, and celebrate with feasts.",
      "relatedHolidays": ["Lohri"]
    },
    "April 14": {
      "name": "Ambedkar Jayanti",
      "description": "Ambedkar Jayanti commemorates the birth anniversary of Dr. B.R. Ambedkar, the principal architect of the Indian Constitution.",
      "history": "Dr. B.R. Ambedkar was born on 14 April 1891. He is remembered for his contributions to social justice and the Indian Constitution.",
      "type": ["National", "Cultural"],
      "howToCelebrate": "People pay tribute to Ambedkar by visiting his memorials, participating in cultural events, and holding discussions on his works.",
      "relatedHolidays": []
    },
    "April 17": {
      "name": "Ram Navami",
      "description": "Ram Navami is a Hindu festival celebrating the birth of Lord Rama, the seventh avatar of Vishnu.",
      "history": "Ram Navami is celebrated as the birthday of Lord Rama, who is believed to have been born on this day in Ayodhya.",
      "type": ["Religious"],
      "howToCelebrate": "Devotees read the Ramayana, participate in processions, and offer prayers at temples.",
      "relatedHolidays": ["Diwali"]
    },
    "April 21": {
      "name": "Mahavir Jayanti",
      "description": "Mahavir Jayanti is a Jain festival celebrating the birth of Lord Mahavir, the 24th Tirthankara.",
      "history": "Lord Mahavir was born in 599 BCE in Bihar, India. His teachings form the foundation of Jainism.",
      "type": ["Religious"],
      "howToCelebrate": "Jains visit temples, meditate, and listen to teachings about Lord Mahavir's life.",
      "relatedHolidays": []
    },
    "May 23": {
      "name": "Budh Purnima",
      "description": "Budh Purnima, also known as Buddha Jayanti, celebrates the birth, enlightenment, and death of Gautama Buddha.",
      "history": "Budh Purnima is celebrated on the full moon day in the Hindu month of Vaisakha. It commemorates the three major events in Buddha's life.",
      "type": ["Religious"],
      "howToCelebrate": "Buddhists visit temples, offer prayers, meditate, and share Buddha's teachings.",
      "relatedHolidays": []
    },
    "June 17": {
      "name": "Id-ul-Zuha",
      "description": "Id-ul-Zuha, also known as Eid al-Adha or Bakrid, is an Islamic festival of sacrifice, commemorating Ibrahim's willingness to sacrifice his son.",
      "history": "Eid al-Adha honors Ibrahim's (Abraham's) obedience to God. It is celebrated after the annual Hajj pilgrimage.",
      "type": ["Religious"],
      "howToCelebrate": "Muslims perform prayers, sacrifice an animal, and distribute the meat among family, friends, and the poor.",
      "relatedHolidays": ["Id-ul-Fitr"]
    },
    "July 17": {
      "name": "Muharram",
      "description": "Muharram is the first month of the Islamic calendar and is observed as a period of mourning and reflection by Shia Muslims.",
      "history": "Muharram is observed in memory of the martyrdom of Imam Hussain, the grandson of the Prophet Muhammad, at the Battle of Karbala.",
      "type": ["Religious"],
      "howToCelebrate": "Shia Muslims observe fasts, participate in processions, and engage in mourning rituals.",
      "relatedHolidays": []
    },
    "August 15": {
      "name": "Independence Day",
      "description": "Independence Day celebrates India's freedom from British rule on August 15, 1947.",
      "history": "India gained independence from British rule on August 15, 1947. It is a national holiday and is celebrated with flag hoisting and cultural events.",
      "type": ["National"],
      "howToCelebrate": "The Prime Minister hoists the national flag at the Red Fort in Delhi, followed by a speech and cultural performances across the country.",
      "relatedHolidays": ["Republic Day", "Gandhi Jayanti"]
    },
    "August 19": {
      "name": "Janmashtami",
      "description": "Janmashtami is a Hindu festival celebrating the birth of Lord Krishna, the eighth avatar of Vishnu.",
      "history": "Janmashtami is observed on the eighth day of the dark fortnight in the month of Bhadrapada and marks Krishna's birth in Mathura.",
      "type": ["Religious"],
      "howToCelebrate": "Devotees fast, sing devotional songs, and reenact episodes from Krishna's life, especially the Raas Leela.",
      "relatedHolidays": []
    },
    "September 17": {
      "name": "Ganesh Chaturthi",
      "description": "Ganesh Chaturthi is a Hindu festival celebrating the birth of Lord Ganesha, the elephant-headed god of wisdom and prosperity.",
      "history": "Ganesh Chaturthi is celebrated with grand enthusiasm, especially in Maharashtra, and marks the beginning of the festival of Ganesha's birth.",
      "type": ["Religious"],
      "howToCelebrate": "People set up Ganesh idols, perform prayers, sing devotional songs, and organize processions for immersion.",
      "relatedHolidays": ["Ganesh Visarjan"]
    },
    "October 2": {
      "name": "Gandhi Jayanti",
      "description": "Gandhi Jayanti commemorates the birth anniversary of Mahatma Gandhi, the leader of India's non-violent independence movement.",
      "history": "Mahatma Gandhi was born on October 2, 1869. The day is observed as the International Day of Non-Violence.",
      "type": ["National", "Cultural"],
      "howToCelebrate": "People attend commemorative events, participate in community service, and reflect on Gandhi's principles of peace and non-violence.",
      "relatedHolidays": ["Independence Day", "Republic Day"]
    },
    "October 24": {
      "name": "Diwali",
      "description": "Diwali, also known as Deepavali, is the Hindu festival of lights celebrating the victory of light over darkness and good over evil.",
      "history": "Diwali is a major Hindu festival celebrated over five days, commemorating the return of Lord Rama to Ayodhya after defeating Ravana.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "People light oil lamps, burst crackers, exchange sweets, and participate in pujas dedicated to Lakshmi, the goddess of wealth.",
      "relatedHolidays": ["Dhanteras", "Bhai Dooj"]
    },
    "November 1": {
      "name": "All Saints Day",
      "description": "All Saints Day is a Christian holiday honoring all saints, known and unknown, who have attained heaven.",
      "history": "All Saints Day is celebrated on November 1st and is dedicated to saints who are not specifically honored on other days.",
      "type": ["Religious"],
      "howToCelebrate": "Christians attend church services, light candles in memory of saints, and reflect on the lives of holy figures.",
      "relatedHolidays": []
    },
    "November 15": {
      "name": "Guru Nanak Jayanti",
      "description": "Guru Nanak Jayanti, also known as Gurpurab, celebrates the birth of Guru Nanak, the founder of Sikhism.",
      "history": "Guru Nanak was born on 15 November 1469. His teachings form the basis of Sikhism and emphasize equality and devotion to God.",
      "type": ["Religious"],
      "howToCelebrate": "Sikhs attend Gurdwara services, sing hymns, and participate in processions.",
      "relatedHolidays": []
    },
    "November 23": {
      "name": "Chhath Puja",
      "description": "Chhath Puja is a Hindu festival dedicated to the Sun God and is primarily celebrated in Bihar, Jharkhand, and Uttar Pradesh.",
      "history": "The festival is observed over four days and involves rituals to thank the Sun God for sustaining life on Earth.",
      "type": ["Religious"],
      "howToCelebrate": "Devotees fast, offer prayers, and perform rituals on riverbanks or water bodies during sunrise and sunset.",
      "relatedHolidays": []
    },
    "December 25": {
      "name": "Christmas",
      "description": "Christmas is a Christian festival celebrating the birth of Jesus Christ.",
      "history": "Christmas is observed on December 25th and marks the birth of Jesus, who is considered the Son of God in Christianity.",
      "type": ["Religious", "Cultural"],
      "howToCelebrate": "Christians attend church services, decorate homes with Christmas trees, exchange gifts, and enjoy festive meals.",
      "relatedHolidays": []
    }
  }
}
